package main

import "fmt"

func fForMatrix() {
	matrix := make([][]int, 10)
	counter := 0

	for x := 0; x < 10; x++ { // цикл может быть без условия или без конечного действия = будет бесконечный цикл
		// например for x := 0; x < 10 или x := 0; x++
		matrix[x] = make([]int, 10)
		for y := 0; y < 10; y++ {
			counter++
			matrix[x][y] = counter
		}
		fmt.Println(matrix[x])
		/*
			[1 2 3 4 5 6 7 8 9 10]
			[11 12 13 14 15 16 17 18 19 20]
			[21 22 23 24 25 26 27 28 29 30]
			[31 32 33 34 35 36 37 38 39 40]
			[41 42 43 44 45 46 47 48 49 50]
			[51 52 53 54 55 56 57 58 59 60]
			[61 62 63 64 65 66 67 68 69 70]
			[71 72 73 74 75 76 77 78 79 80]
			[81 82 83 84 85 86 87 88 89 90]
			[91 92 93 94 95 96 97 98 99 100]
		*/
	}

	// итерировать слайсы можно и так
	for i := range matrix {
		fmt.Println(matrix[i])
		/*
			[1 2 3 4 5 6 7 8 9 10]
			[11 12 13 14 15 16 17 18 19 20]
			[21 22 23 24 25 26 27 28 29 30]
			[31 32 33 34 35 36 37 38 39 40]
			[41 42 43 44 45 46 47 48 49 50]
			[51 52 53 54 55 56 57 58 59 60]
			[61 62 63 64 65 66 67 68 69 70]
			[71 72 73 74 75 76 77 78 79 80]
			[81 82 83 84 85 86 87 88 89 90]
			[91 92 93 94 95 96 97 98 99 100]
		*/
	}
}
